{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.20.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 6], "dtype": "float64", "sparse": false, "ragged": false, "name": "input_layer"}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_layer_1", "trainable": true, "dtype": "float64", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_layer_1", "inbound_nodes": [[["input_layer", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_layer_2", "trainable": true, "dtype": "float64", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_layer_2", "inbound_nodes": [[["dense_layer_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_layer_3", "trainable": true, "dtype": "float64", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_layer_3", "inbound_nodes": [[["dense_layer_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "predicted_lightcurve", "trainable": true, "dtype": "float64", "units": 1000, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "predicted_lightcurve", "inbound_nodes": [[["dense_layer_3", 0, 0, {}]]]}], "input_layers": [["input_layer", 0, 0]], "output_layers": [["predicted_lightcurve", 0, 0]]}}, "training_config": {"loss": "mse", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": {"class_name": "PiecewiseConstantDecay", "config": {"boundaries": [100.0, 1000.0, 10000.0, 100000.0, 1000000.0], "values": [0.0017941, 0.00035882000000000004, 7.1764e-05, 1.4352800000000001e-05, 2.8705600000000003e-06, 5.74112e-07], "name": null}}, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_layer_1/kernel", "shape": [6, 64], "dtype": "float32"}, {"name": "dense_layer_1/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_layer_2/kernel", "shape": [64, 128], "dtype": "float32"}, {"name": "dense_layer_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_layer_3/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "dense_layer_3/bias", "shape": [128], "dtype": "float32"}, {"name": "predicted_lightcurve/kernel", "shape": [128, 1000], "dtype": "float32"}, {"name": "predicted_lightcurve/bias", "shape": [1000], "dtype": "float32"}]}]}